데이터 불러오기

In [7]:
import pandas as pd

df = pd.read_csv("data/Lemonade2016.csv")
df.head(1)

       Date Location  Lemon  Orange  Temperature  Leaflets  Price
0  7/1/2016     Park     97      67           70      90.0   0.25

## 데이터 둘러보기
- 첫번째 확인: 결측치(=값이 중간에 비어있음)가 존재하는지 확인
- 데이터 분석을 할 때, 결측치가 왜 있으면 안될까?
    + y = x + 1

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32 entries, 0 to 31
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Date         31 non-null     object
 1   Location     32 non-null     object
 2   Lemon        32 non-null     int64
 3   Orange       32 non-null     int64
 4   Temperature  32 non-null     int64
 5   Leaflets     31 non-null     float64
 6   Price        32 non-null     float64
dtypes: float64(2), int64(3), object(2)
memory usage: 1.9+ KB

In [9]:
df.describe  # 기술통계량 제공

<bound method NDFrame.describe of          Date Location  Lemon  Orange  Temperature  Leaflets  Price
0    7/1/2016     Park     97      67           70      90.0   0.25
1    7/2/2016     Park     98      67           72      90.0   0.25
2    7/3/2016     Park    110      77           71     104.0   0.25
3    7/4/2016    Beach    134      99           76      98.0   0.25
4    7/5/2016    Beach    159     118           78     135.0   0.25
5    7/6/2016    Beach    103      69           82      90.0   0.25
6    7/6/2016    Beach    103      69           82      90.0   0.25
7    7/7/2016    Beach    143     101           81     135.0   0.25
8         NaN    Beach    123      86           82     113.0   0.25
9    7/9/2016    Beach    134      95           80     126.0   0.25
10  7/10/2016    Beach    140      98           82     131.0   0.25
11  7/11/2016    Beach    162     120           83     135.0   0.25
12  7/12/2016    Beach    130      95           84      99.0   0.25
13  7/13/2016    Beach    109      75           77      99.0   0.25
14  7/14/2016    Beach    122      85           78     113.0   0.25
15  7/15/2016    Beach     98      62           75     108.0   0.50
16  7/16/2016    Beach     81      50           74      90.0   0.50
17  7/17/2016    Beach    115      76           77     126.0   0.50
18  7/18/2016     Park    131      92           81     122.0   0.50
19  7/19/2016     Park    122      85           78     113.0   0.50
20  7/20/2016     Park     71      42           70       NaN   0.50
21  7/21/2016     Park     83      50           77      90.0   0.50
22  7/22/2016     Park    112      75           80     108.0   0.50
23  7/23/2016     Park    120      82           81     117.0   0.50
24  7/24/2016     Park    121      82           82     117.0   0.50
25  7/25/2016     Park    156     113           84     135.0   0.50
26  7/26/2016     Park    176     129           83     158.0   0.35
27  7/27/2016     Park    104      68           80      99.0   0.35
28  7/28/2016     Park     96      63           82      90.0   0.35
29  7/29/2016     Park    100      66           81      95.0   0.35
30  7/30/2016    Beach     88      57           82      81.0   0.35
31  7/31/2016    Beach     76      47           82      68.0   0.35>

In [10]:
df['Location'].value_counts()

Location
Beach    17
Park     15
Name: count, dtype: int64

## 중복값 존재 유무 확인
- .drop_duplicates()

## 데이터 다뤄보기
- 행과 열을 다뤄보기

In [73]:
# 판매량 추가
df['Sold'] = 0
df.head()

               height      weight  gender  Sold
2000-01-01  70.151923  166.723611    male     0
2000-01-02  68.021370  207.318913  female     0
2000-01-03  69.006705  170.730596    male     0
2000-01-04  71.433647  163.805108    male     0
2000-01-05  52.402817  206.852145    male     0

In [ ]:
df['Sold'] = df['Lemon'] + df['Orange']
df.head(1)

In [ ]:
# 매출액 구하기
df['매출액'] = df['Sold'] * df['Price']
df = df.drop_duplicates(keep = 'first', ignore_index=True)
df

## 분석 프로젝트
-파생변수 매출액을 사칙연산(=알고리즘)을 활용하여 만들어서 분석하는 것
- 판매량, 단가
- 판매량은 있는데 단가가 없으면 -> 단가 리스트를 구하는 것이 프로젝트

## 컬럼 제거
- 불필요한 컬럼 제거
    + 필요한 컬럼 선택을 하는 방법도 존대
    + 컬럼 갯수가 100개, 3개 삭제

In [ ]:
df.head(1)

In [ ]:
df2 = df.drop('매출액', axis = 1)
df2.head()

In [ ]:
df3 = df.drop(0, axis=0)
df3.head()

In [12]:
# 행 추출
# Location이 Beach인 것만 추출
# Loc 사용하시고, 모든 컬럼 조회

df.loc[df['Location'] == 'Beach', :]

         Date Location  Lemon  Orange  Temperature  Leaflets  Price
3    7/4/2016    Beach    134      99           76      98.0   0.25
4    7/5/2016    Beach    159     118           78     135.0   0.25
5    7/6/2016    Beach    103      69           82      90.0   0.25
6    7/6/2016    Beach    103      69           82      90.0   0.25
7    7/7/2016    Beach    143     101           81     135.0   0.25
8         NaN    Beach    123      86           82     113.0   0.25
9    7/9/2016    Beach    134      95           80     126.0   0.25
10  7/10/2016    Beach    140      98           82     131.0   0.25
11  7/11/2016    Beach    162     120           83     135.0   0.25
12  7/12/2016    Beach    130      95           84      99.0   0.25
13  7/13/2016    Beach    109      75           77      99.0   0.25
14  7/14/2016    Beach    122      85           78     113.0   0.25
15  7/15/2016    Beach     98      62           75     108.0   0.50
16  7/16/2016    Beach     81      50           74      90.0   0.50
17  7/17/2016    Beach    115      76           77     126.0   0.50
30  7/30/2016    Beach     88      57           82      81.0   0.35
31  7/31/2016    Beach     76      47           82      68.0   0.35

In [74]:
# 데이터 정렬, sort_values()
df.sort_values(by=['Sold'], ascending=False).head(5)

               height      weight  gender  Sold
2000-01-01  70.151923  166.723611    male     0
2000-01-02  68.021370  207.318913  female     0
2000-01-03  69.006705  170.730596    male     0
2000-01-04  71.433647  163.805108    male     0
2000-01-05  52.402817  206.852145    male     0

## GroupBy 연산
- SQL: Group By와 Logic은 동일함
- Groupby 기준컬럼: 패턴이 있는 문자열
- Groupby 대상컬럼: 수치 데이터
- 필요한 함수: 집계함수 (합, 평균, 표준편차, 최대, 최소 등)

# 우리나라 국민의 소득 수준 비교 (행정동)
- 행정동 수천개 ==> 비교하는 것이 의미?
- 시군구 수백개 ==> 비교하는 것이 의미?
- 광역시도단위 ==> 17개로 줄임 (비교하는 것이 의미가 있음)
- 권역 단위 ==> 수도권, 충청권, 호남권, 영남권, 관광특구

In [ ]:
# df.groupby('기준칼럼')['대상컬럼']
df.groupby('Location')['매출액'].agg(['sum', 'mean', 'std'])

In [ ]:
df.groupby('Location')['매출액'].agg(['sum', 'mean', 'std']).reset_index()

## Group by: split-apply-combine
- SELECT Column1, Column2, mean(Column3), sum(Column4)
- FROM SomeTable
- GROUP BY Column1, Column2

In [17]:
import numpy as np

# Splitting an object into groups
speeds = pd.DataFrame(
    [
        ("bird", "Falconiformes", 389.0),
        ("bird", "Psittaciformes", 24.0),
        ("mammal", "Carnivora", 80.2),
        ("mammal", "Primates", np.nan),
        ("mammal", "Carnivora", 58),
    ],
    index=["falcon", "parrot", "lion", "monkey", "leopard"],
    columns=("class", "order", "max_speed"),
)

In [18]:
speeds

          class           order  max_speed
falcon     bird   Falconiformes      389.0
parrot     bird  Psittaciformes       24.0
lion     mammal       Carnivora       80.2
monkey   mammal        Primates        NaN
leopard  mammal       Carnivora       58.0

In [23]:
grouped = speeds.groupby("class")
grouped

In [24]:
grouped = speeds.groupby(["class", "order"])

In [25]:
grouped

In [46]:
df = pd.DataFrame(
    {
        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
        "C": np.random.randn(8),
        "D": np.random.randn(8),
    }
)
df

     A      B         C         D
0  foo    one  0.529701  0.728179
1  bar    one  0.526324  0.167791
2  foo    two -0.705078 -0.312337
3  bar  three -0.868777 -0.035108
4  foo    two  0.637382  0.551480
5  bar    two -0.367151 -0.423959
6  foo    one  3.112079 -1.721973
7  foo  three  1.086215 -0.025634

In [27]:
grouped = df.groupby("A")
grouped = df.groupby(["A", "B"])

In [28]:
grouped

In [29]:
df2 = df.set_index(["A", "B"])
grouped = df2.groupby(level=df2.index.names.difference(["B"]))
grouped.sum()

            C         D
A
bar  2.002208  1.262902
foo  3.931343  0.685573

In [31]:
df2 = pd.DataFrame({"X": ["B", "B", "A", "A"], "Y": [1, 2, 3, 4]})
df2.groupby(["X"]).sum()

   Y
X
A  7
B  3

In [32]:
df2.groupby(["X"], sort=False).sum()

   Y
X
B  3
A  7

In [41]:
df3 = pd.DataFrame({"X": ["A", "B", "A", "B"], "Y": [1, 4, 3, 2]})
df3

   X  Y
0  A  1
1  B  4
2  A  3
3  B  2

In [34]:
df3.groupby(["X"]).get_group("A")

   X  Y
0  A  1
2  A  3

In [35]:
df3.groupby(["X"]).get_group("B")

   X  Y
1  B  4
3  B  2

In [42]:
df_list = [[1, 2, 3], [1, None, 4], [2, 1, 3], [1, 2, 2]]
df_list

[[1, 2, 3], [1, None, 4], [2, 1, 3], [1, 2, 2]]

In [37]:
df_dropna = pd.DataFrame(df_list, columns=["a", "b", "c"])

In [38]:
df_dropna

   a    b  c
0  1  2.0  3
1  1  NaN  4
2  2  1.0  3
3  1  2.0  2

In [39]:
df_dropna.groupby(by=["b"], dropna=True).sum()

     a  c
b
1.0  2  3
2.0  2  5

In [40]:
df_dropna.groupby(by=["b"], dropna=False).sum()

     a  c
b
1.0  2  3
2.0  2  5
NaN  1  4

In [49]:
def get_letter_type(letter):
    if letter.lower() in 'aeiou':
        return 'vowel'
    else:
        return 'consonant'

In [50]:
grouped = df.T.groupby(get_letter_type)

## GroupBy object attributes

In [43]:
df.groupby("A").groups

{'bar': [1, 3, 5], 'foo': [0, 2, 4, 6, 7]}

In [52]:
def get_letter_type(letter):
    if letter.lower() in 'aeiou':
        return 'vowel'
    else:
        return 'consonant'


grouped = df.T.groupby(get_letter_type)

In [53]:
df.T.groupby(get_letter_type).groups

{'consonant': ['B', 'C', 'D'], 'vowel': ['A']}

In [54]:
lst = [1, 2, 3, 1, 2, 3]

s = pd.Series([1, 2, 3, 10, 20, 30], lst)

grouped = s.groupby(level=0)

grouped.first()

1    1
2    2
3    3
dtype: int64

In [56]:
grouped.last()

1    10
2    20
3    30
dtype: int64

In [58]:
grouped.sum()

1    11
2    22
3    33
dtype: int64

In [61]:
df.T.groupby(get_letter_type).groups

{'consonant': ['B', 'C', 'D'], 'vowel': ['A']}

In [64]:
grouped = df.groupby(["A", "B"])
grouped

In [65]:
grouped.groups

{('bar', 'one'): [1], ('bar', 'three'): [3], ('bar', 'two'): [5], ('foo', 'one'): [0, 6], ('foo', 'three'): [7], ('foo', 'two'): [2, 4]}

In [66]:
len(grouped)

6

In [67]:
n = 10

weight = np.random.normal(166, 20, size=n)

height = np.random.normal(60, 10, size=n)

time = pd.date_range("1/1/2000", periods=n)

gender = np.random.choice(["male", "female"], size=n)

df = pd.DataFrame(
    {"height": height, "weight": weight, "gender": gender}, index=time
)


df

               height      weight  gender
2000-01-01  70.151923  166.723611    male
2000-01-02  68.021370  207.318913  female
2000-01-03  69.006705  170.730596    male
2000-01-04  71.433647  163.805108    male
2000-01-05  52.402817  206.852145    male
2000-01-06  62.101740  159.473101  female
2000-01-07  43.135045  173.298025  female
2000-01-08  56.247682  178.128090    male
2000-01-09  44.447823  187.836726  female
2000-01-10  46.429564  158.996296  female

In [71]:
gb = df.groupby("gender")
gb